import 'package:adv_basics/models/quiz_question.dart';

const questions = [
  QuizQuestion(
    'Кто был первым человеком, отправившимся в космос?',
    [
      'Юрий Гагарин',
      'Нил Армстронг',
      'Джон Гленн',
      'Баз Альдрина',
    ],
  ),
  QuizQuestion(
    'Какой американский изобретатель известен как "отец электричества"?',
    [
      'Никола Тесла',
      'Томас Эдисон',
      'Александр Грэм Белл',
      'Бенджамин Франклин',
    ],
  ),
  QuizQuestion(
    'Кто написал "Ромео и Джульетта"?',
    [
      'Уильям Шекспир',
      'Фёдор Достоевский',
      'Джейн Остин',
      'Марк Твен',
    ],
  ),
  QuizQuestion(
    'Кто был основателем современной теории относительности?',
    [
      'Альберт Эйнштейн',
      'Исаак Ньютон',
      'Галилео Галилей',
      'Нильс Бор',
    ],
  ),
  QuizQuestion(
    'Кто была первой женщиной-космонавтом?',
    [
      'Валентина Терешкова',
      'Салли Райд',
      'Кристи Маккаллоф',
      'Юрий Гагарин',
    ],
  ),
  QuizQuestion(
    'Какой американский мартингейл лидерил движение за гражданские права чернокожих в США?',
    [
      'Мартин Лютер Кинг мл.',
      'Малкольм Икс',
      'Роза Паркс',
      'Харриет Табман',
    ],
  ),
  QuizQuestion(
    'Кто был философом, автором "Принципов философии" и "Я думаю, следовательно, я существую"?',
    [
      'Рене Декарт',
      'Иммануил Кант',
      'Фридрих Ницше',
      'Джон Локк',
    ],
  ),
];
